// This file is part of Adlib Tracker II (AT2).
//
// SPDX-FileType: SOURCE
// SPDX-FileCopyrightText: 2014-2024 The Adlib Tracker 2 Authors
// SPDX-License-Identifier: GPL-3.0-or-later

const char *patt_win_tracks[3][5] = {
  {
    "ษออออหอออออออออออออออออออออออออออ PATTERN EDiTOR (  ) ออออออออออออออออออออออออออหออออป",
    "บLiNEบ 1            ณ 2            ณ 3            ณ 4            ณ 5            บLiNEบ",
    "ฬออออฮออออออออออออออัออออออออออออออัออออออออออออออัออออออออออออออัออออออออออออออฮออออน",
    "บ    บ              ณ              ณ              ณ              ณ              บ    บ",
    "ศออออสออออออออออออออฯออออออออออออออฯออออออออออออออฯออออออออออออออฯออออออออออออออสออออผ"
  }, {
    "ษออออหออออออออออออออออออออออออออออออออออออออออออ PATTERN EDiTOR (  ) อออออออออออออออออออออออออออออออออออออออออหออออป",
    "บLiNEบ 1            ณ 2            ณ 3            ณ 4            ณ 5            ณ 6            ณ 7            บLiNEบ",
    "ฬออออฮออออออออออออออัออออออออออออออัออออออออออออออัออออออออออออออัออออออออออออออัออออออออออออออัออออออออออออออฮออออน",
    "บ    บ              ณ              ณ              ณ              ณ              ณ              ณ              บ    บ",
    "ศออออสออออออออออออออฯออออออออออออออฯออออออออออออออฯออออออออออออออฯออออออออออออออฯออออออออออออออฯออออออออออออออสออออผ"
  }, {
    "ษออออหออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออ PATTERN EDiTOR (  ) อออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออออหออออป",
    "บLiNEบ 1            ณ 2            ณ 3            ณ 4            ณ 5            ณ 6            ณ 7            ณ 8            ณ 9            ณ 10           ณ 11           บLiNEบ",
    "ฬออออฮออออออออออออออัออออออออออออออัออออออออออออออัออออออออออออออัออออออออออออออัออออออออออออออัออออออออออออออัออออออออออออออัออออออออออออออัออออออออออออออัออออออออออออออฮออออน",
    "บ    บ              ณ              ณ              ณ              ณ              ณ              ณ              ณ              ณ              ณ              ณ              บ    บ",
    "ศออออสออออออออออออออฯออออออออออออออฯออออออออออออออฯออออออออออออออฯออออออออออออออฯออออออออออออออฯออออออออออออออฯออออออออออออออฯออออออออออออออฯออออออออออออออฯออออออออออออออสออออผ"
  }
};

String patt_win[5][176+1] = { 0 };
